import spacy
import pandas as pd

model_1 = r'C:\tmp\model'
model_2 = 'el_core_news_sm'

testtext = u'Τέλος, στο αδιέξοδο της επιλογής των προσωπών που θα αναλάβουν τα κορυφαία αξιώματα της Ε.Ε.-μετά από \
τρεις ημέρες διαπραγματεύσεων,έδωσαν οι Ευρωπαίοι ηγέτες. Για να διαδεχθεί τον Ζαν-Κλοντ Γιουνκέρ στην προεδρία \
της Ευρωπαϊκής Επιτροπής οι «28» πρότειναν στη σημερινή Σύνοδο Κορυφής στις Βρυξέλλες, τη Γερμανίδα υπουργό Αμυνας \
Ούρσουλα φον ντερ Λάιεν. Ο πρόεδρος του Ευρωπαϊκού Συμβουλίου Ντόναλντ Τούσκ –σε μία σειρά από αναρτήσεις στο Twitter- \
ανακοίνωσε ότι ο Βέλγος πρωθυπουργός Σάρλ Μισέλ θα τον αντικαταστήσει το φθινόπωρο. Η Κριστίν Λαγκάρντ, η οποία \
ανακοίνωσε ότι αποχωρεί προσωρινά από την ηγεσία του Διεθνούς Νομισματικού Ταμείου, προτάθηκε για την προεδρία της \
Ευρωπαϊκής Κεντρικής Τράπεζας, ενώ ο Ισπανός υπουργός Εξωτερικών Τζοσεπ Μπορέλ ως επικεφαλής της Ευρωπαϊκής \
διπλωματίας. Η πρόταση ήταν ομόφωνη, εκτός από την αποχή της ίδιας, δήλωσε η Γερμανίδα καγκελάριος Αγκελα Μέρκελ, \
μετά την ολοκλήρωση των συνομιλιών στις Βρυξέλλες.Εξήγησε ότι τα κόμματα του κυβερνητικού συνασπισμού είχαν αποφασίσει \
ότι αν δεν κατέληγαν σε κάποια συμφωνία στο πρόσωπο του υποψηφίου για την προεδρία της Κομισιόν, τότε εκείνη θα απείχε.\
«Θετικές και συναινετικές» χαρακτήρισε τις υποψηφιότητες για τα κορυφαία αξιώματα της Ενωσης, ο Γάλλος πρόεδρος \
Εμανουέλ Μακρόν, προσθέτοντας πώς προσφέρουν μία νέα αρχή για το μπλοκ. «Αυτή η συμφωνία είναι καρπός μιας βαθιάς\
γαλλογερμανικής συμφωνίας» επισήμανε ο Μακρόν. «Στην τελική, η Ευρώπη είναι γυναίκα», ανέφερε ο Τούσκ, στη\
συνέντευξη Τύπου μετά το τέλος των διαπραγματεύσεων, προσθέτοντας πως είναι «απολύτως σίγουρος» ότι η Κριστίν Λαγκάρντ \
θα ήταν η νέα πρόεδρος της ΕΚΤ. «Βαθιά απογοητευτική» χαρακτηρίζει την πρόταση του Ευρωπαϊκού Συμβουλίου από τη μεριά \
της η επικεφαλής της ομάδας των Σοσιαλδημοκρατών στο Ευρωκοινοβούλιο, Ιράτκε Γκαρσία. «Η ομάδα μας έμεινε πιστή στην \
υπεράσπιση της Ευρωπαϊκής δημοκρατίας και τη διαδικασία του κορυφαίου υποψήφιου ή Spitzenkandidat και δε θέλουμε να\
πεθάνει», είπε χαρακτηριστικά, προσθέτοντας ότι είναι «απαράδεκτο ότι οι εκπρόσωποι των λαϊκιστικών κυβερνήσεων στο \
Ευρωπαϊκό Συμβούλιο απέρριψαν τον καλύτερο υποψήφιο μόνο γιατί υπερασπίστηκε το κράτος δικαίου και τις κοινές\
Ευρωπαϊκές μας αρχές». Μόνο ο κ. Μισέλ μπορεί να αναλάβει επισήμως τα καθήκοντα  του χωρίς να κινηθούν περαιτέρω \
διαδικασίες. Οι υπόλοιπες υποψηφιότητες –ειδικά της φον ντερ Λάιεν- πρέπει να επικυρωθεί από το Ευρωκοινοβούλιο, το\
οποίο συνεδριάζει αύριο, Τετάρτη, για να εκλέξει τον νέο του πρόεδρο. Αρκετοί ευρωβουλευτές έχουν ήδη εκφράσει\
ανησυχίες για το «πακέτο των υποψηφίων» και περιμένουν αν η νέα σύνθεση του Ευρωκοινοβουλίου μετά τις ευρωεκλογές\
του Μαΐου θα δώσει το «πράσινο φως» στα πρόσωπα που πρότειναν οι Ευρωπαίοι ηγέτες. «Δεν θα είναι εύκολο να περάσει\
από το Ευρωκοινοβούλιο», δήλωσε ο Γιούνκερ, η θητεία του οποίου στην προεδρία της Κομισιόν τελειώνει στις\
31 Οκτωβρίου. Αν εκλεχθεί η φον ντερ Λάιεν θα είναι η πρώτη γυναίκα που αναλαμβάνει τη θέση της προέδρου της Κομισιόν.'

def compare_two_models(model_1, model_2, test_text):
    nlp_1 = spacy.load(model_1)
    nlp_2 = spacy.load(model_2)
    doc1 = nlp_1(test_text)
    doc2 = nlp_2(test_text)


    d_1 = {idx:{'text':ent.text,'start_char':ent.start_char,'end_char':ent.end_char,'label':ent.label_,'model':1} for idx,ent in enumerate(doc1.ents)}
    d_2 = {idx: {'text': ent.text, 'start_char': ent.start_char, 'end_char': ent.end_char, 'label': ent.label_,'model':2} for
           idx, ent in enumerate(doc2.ents)}
    df1 = pd.DataFrame.from_dict(d_1,orient='index')
    df2 = pd.DataFrame.from_dict(d_2, orient='index')
    #print(df1)
    #print(df2)
    df = pd.concat([df1, df2])
    print(df.sort_values('start_char', axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last').to_string())

compare_two_models(model_1,model_2,testtext)